In [127]:
import pandas as pd
import datetime
from dateutil.relativedelta import relativedelta

In [128]:
from datetime import datetime as dt
import time

def toYearFraction(date):
    def sinceEpoch(date): # returns seconds since epoch
        return time.mktime(date.timetuple())
    s = sinceEpoch

    year = date.year
    startOfThisYear = dt(year=year, month=1, day=1)
    startOfNextYear = dt(year=year+1, month=1, day=1)

    yearElapsed = s(date) - s(startOfThisYear)
    yearDuration = s(startOfNextYear) - s(startOfThisYear)
    fraction = yearElapsed/yearDuration

    return date.year + fraction

toYearFraction(dt.today())

2020.1467198884336

In [129]:
data  = pd.read_csv("brand_values.csv")
data.head(5)

    name     value    year  lastValue  rank
0  Apple  214480.0  2018.0   211447.4     1
1  Apple  211447.4  2017.9   208414.8     1
2  Apple  208414.8  2017.8   205382.2     1
3  Apple  205382.2  2017.7   202349.6     1
4  Apple  202349.6  2017.6   199317.0     1

In [130]:
data = pd.read_csv("spotify_incomplete.csv")
data.rename(columns = {"title":"name", "streams":"value"}, inplace=True)
data['date'] = pd.to_datetime(data["date"])
data['value'] = data['value'].apply(lambda x: x.replace(",", ""))
data['value'] = pd.to_numeric(data['value'])
data.head(5)

,rank,artist,name,value,date,country,country_code
0,1,The Weeknd,Starboy,3135625,2017-01-01,global,global
1,2,The Chainsmokers,Closer (feat. Halsey),3015525,2017-01-01,global,global
2,3,DJ Snake,Let Me Love You,2545384,2017-01-01,global,global
3,4,Clean Bandit,Rockabye (feat. Sean Paul & Anne-Marie),2356604,2017-01-01,global,global
4,5,Drake,One Dance,2259887,2017-01-01,global,global

In [131]:
data['lastValue'] = data.groupby('name')['value'].shift(1)
data['lastDay'] = data.groupby('name')['date'].shift(1)
data['oneDay'] = (data['date'] - data['lastDay']) == pd.Timedelta(1, unit='d') 
data['lastValue'] = data.apply(lambda row: row['lastValue'] if row['oneDay'] else row['value'], axis=1)

In [132]:
data['year'] = data['date'].apply(toYearFraction)
data = data.drop(["lastDay", "oneDay"], axis=1)
data.head()

,rank,artist,name,value,date,country,country_code,lastValue,year
0,1,The Weeknd,Starboy,3135625,2017-01-01,global,global,3135625.0,2017.0
1,2,The Chainsmokers,Closer (feat. Halsey),3015525,2017-01-01,global,global,3015525.0,2017.0
2,3,DJ Snake,Let Me Love You,2545384,2017-01-01,global,global,2545384.0,2017.0
3,4,Clean Bandit,Rockabye (feat. Sean Paul & Anne-Marie),2356604,2017-01-01,global,global,2356604.0,2017.0
4,5,Drake,One Dance,2259887,2017-01-01,global,global,2259887.0,2017.0

In [125]:
# data = data[data['country']=="global"]

In [133]:
data.to_csv("spotify.csv")

0